Revit 2027 API
Generic.GenericTransparency Property
 The property labeled "Transparency" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericTransparency { get; }
Public Shared ReadOnly Property GenericTransparency As String
	Get
public:
static property String^ GenericTransparency {
	String^ get ();
}
static member GenericTransparency : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1". This property allows a connected asset.
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace